{"o1fkEBNvhS0HUnIY/contentState":{"id":"o1fkEBNvhS0HUnIY/contentState","type":"contentState","selectionStart":110,"selectionEnd":110,"scrollPosition":{"sectionIdx":0,"posInSection":0},"hash":1541703534002},"F0kmy4RsN8i2DHCd/contentState":{"id":"F0kmy4RsN8i2DHCd/contentState","type":"contentState","selectionStart":3385,"selectionEnd":6929,"scrollPosition":{"sectionIdx":18,"posInSection":0.8019750519750519},"hash":1546460535937},"ymxpGNslZiJsGDeS/contentState":{"id":"ymxpGNslZiJsGDeS/contentState","type":"contentState","selectionStart":3855,"selectionEnd":3855,"scrollPosition":{"sectionIdx":0,"posInSection":0},"hash":1546460558187},"Kcaww5xBmJmy9HDV/contentState":{"id":"Kcaww5xBmJmy9HDV/contentState","type":"contentState","selectionStart":934,"selectionEnd":934,"scrollPosition":{"sectionIdx":0,"posInSection":0},"hash":1546460567918},"skvgCmmZNAXxQzk4/contentState":{"id":"skvgCmmZNAXxQzk4/contentState","type":"contentState","selectionStart":5612,"selectionEnd":5612,"scrollPosition":{"sectionIdx":0,"posInSection":0},"hash":1546460642066},"o1fkEBNvhS0HUnIY/syncedContent":{"id":"o1fkEBNvhS0HUnIY/syncedContent","type":"syncedContent","historyData":{},"syncHistory":{},"v":0,"hash":1541700373250},"F0kmy4RsN8i2DHCd/syncedContent":{"id":"F0kmy4RsN8i2DHCd/syncedContent","type":"syncedContent","historyData":{},"syncHistory":{},"v":0,"hash":1541700481258},"skvgCmmZNAXxQzk4/syncedContent":{"id":"skvgCmmZNAXxQzk4/syncedContent","type":"syncedContent","historyData":{},"syncHistory":{},"v":0,"hash":1541703933284},"ymxpGNslZiJsGDeS/syncedContent":{"id":"ymxpGNslZiJsGDeS/syncedContent","type":"syncedContent","historyData":{},"syncHistory":{},"v":0,"hash":1541704022341},"Kcaww5xBmJmy9HDV/syncedContent":{"id":"Kcaww5xBmJmy9HDV/syncedContent","type":"syncedContent","historyData":{},"syncHistory":{},"v":0,"hash":1541704418661},"o1fkEBNvhS0HUnIY/content":{"id":"o1fkEBNvhS0HUnIY/content","type":"content","text":"# Welcome to StackEdit!\n\nHi! I'm your first Markdown file in **StackEdit**. If you want to learn about StackEdit, you can read me. If you want to play with Markdown, you can edit me. Once you have finished with me, you can create new files by opening the **file explorer** on the left corner of the navigation bar.\n\n\n# Files\n\nStackEdit stores your files in your browser, which means all your files are automatically saved locally and are accessible **offline!**\n\n## Create files and folders\n\nThe file explorer is accessible using the button in left corner of the navigation bar. You can create a new file by clicking the **New file** button in the file explorer. You can also create folders by clicking the **New folder** button.\n\n## Switch to another file\n\nAll your files are listed in the file explorer. You can switch from one to another by clicking a file in the list.\n\n## Rename a file\n\nYou can rename the current file by clicking the file name in the navigation bar or by clicking the **Rename** button in the file explorer.\n\n## Delete a file\n\nYou can delete the current file by clicking the **Remove** button in the file explorer. The file will be moved into the **Trash** folder and automatically deleted after 7 days of inactivity.\n\n## Export a file\n\nYou can export the current file by clicking **Export to disk** in the menu. You can choose to export the file as plain Markdown, as HTML using a Handlebars template or as a PDF.\n\n\n# Synchronization\n\nSynchronization is one of the biggest features of StackEdit. It enables you to synchronize any file in your workspace with other files stored in your **Google Drive**, your **Dropbox** and your **GitHub** accounts. This allows you to keep writing on other devices, collaborate with people you share the file with, integrate easily into your workflow... The synchronization mechanism takes place every minute in the background, downloading, merging, and uploading file modifications.\n\nThere are two types of synchronization and they can complement each other:\n\n- The workspace synchronization will sync all your files, folders and settings automatically. This will allow you to fetch your workspace on any other device.\n\t> To start syncing your workspace, just sign in with Google in the menu.\n\n- The file synchronization will keep one file of the workspace synced with one or multiple files in **Google Drive**, **Dropbox** or **GitHub**.\n\t> Before starting to sync files, you must link an account in the **Synchronize** sub-menu.\n\n## Open a file\n\nYou can open a file from **Google Drive**, **Dropbox** or **GitHub** by opening the **Synchronize** sub-menu and clicking **Open from**. Once opened in the workspace, any modification in the file will be automatically synced.\n\n## Save a file\n\nYou can save any file of the workspace to **Google Drive**, **Dropbox** or **GitHub** by opening the **Synchronize** sub-menu and clicking **Save on**. Even if a file in the workspace is already synced, you can save it to another location. StackEdit can sync one file with multiple locations and accounts.\n\n## Synchronize a file\n\nOnce your file is linked to a synchronized location, StackEdit will periodically synchronize it by downloading/uploading any modification. A merge will be performed if necessary and conflicts will be resolved.\n\nIf you just have modified your file and you want to force syncing, click the **Synchronize now** button in the navigation bar.\n\n> **Note:** The **Synchronize now** button is disabled if you have no file to synchronize.\n\n## Manage file synchronization\n\nSince one file can be synced with multiple locations, you can list and manage synchronized locations by clicking **File synchronization** in the **Synchronize** sub-menu. This allows you to list and remove synchronized locations that are linked to your file.\n\n\n# Publication\n\nPublishing in StackEdit makes it simple for you to publish online your files. Once you're happy with a file, you can publish it to different hosting platforms like **Blogger**, **Dropbox**, **Gist**, **GitHub**, **Google Drive**, **WordPress** and **Zendesk**. With [Handlebars templates](http://handlebarsjs.com/), you have full control over what you export.\n\n> Before starting to publish, you must link an account in the **Publish** sub-menu.\n\n## Publish a File\n\nYou can publish your file by opening the **Publish** sub-menu and by clicking **Publish to**. For some locations, you can choose between the following formats:\n\n- Markdown: publish the Markdown text on a website that can interpret it (**GitHub** for instance),\n- HTML: publish the file converted to HTML via a Handlebars template (on a blog for example).\n\n## Update a publication\n\nAfter publishing, StackEdit keeps your file linked to that publication which makes it easy for you to re-publish it. Once you have modified your file and you want to update your publication, click on the **Publish now** button in the navigation bar.\n\n> **Note:** The **Publish now** button is disabled if your file has not been published yet.\n\n## Manage file publication\n\nSince one file can be published to multiple locations, you can list and manage publish locations by clicking **File publication** in the **Publish** sub-menu. This allows you to list and remove publication locations that are linked to your file.\n\n\n# Markdown extensions\n\nStackEdit extends the standard Markdown syntax by adding extra **Markdown extensions**, providing you with some nice features.\n\n> **ProTip:** You can disable any **Markdown extension** in the **File properties** dialog.\n\n\n## SmartyPants\n\nSmartyPants converts ASCII punctuation characters into \"smart\" typographic punctuation HTML entities. For example:\n\n|                |ASCII                          |HTML                         |\n|----------------|-------------------------------|-----------------------------|\n|Single backticks|`'Isn't this fun?'`            |'Isn't this fun?'            |\n|Quotes          |`\"Isn't this fun?\"`            |\"Isn't this fun?\"            |\n|Dashes          |`-- is en-dash, --- is em-dash`|-- is en-dash, --- is em-dash|\n\n\n## KaTeX\n\nYou can render LaTeX mathematical expressions using [KaTeX](https://khan.github.io/KaTeX/):\n\nThe *Gamma function* satisfying $\\Gamma(n) = (n-1)!\\quad\\forall n\\in\\mathbb N$ is via the Euler integral\n\n$$\n\\Gamma(z) = \\int_0^\\infty t^{z-1}e^{-t}dt\\,.\n$$\n\n> You can find more information about **LaTeX** mathematical expressions [here](http://meta.math.stackexchange.com/questions/5020/mathjax-basic-tutorial-and-quick-reference).\n\n\n## UML diagrams\n\nYou can render UML diagrams using [Mermaid](https://mermaidjs.github.io/). For example, this will produce a sequence diagram:\n\n```mermaid\nsequenceDiagram\nAlice ->> Bob: Hello Bob, how are you?\nBob-->>John: How about you John?\nBob--x Alice: I am good thanks!\nBob-x John: I am good thanks!\nNote right of John: Bob thinks a long<br/>long time, so long<br/>that the text does<br/>not fit on a row.\n\nBob-->Alice: Checking with John...\nAlice->John: Yes... John, how are you?\n```\n\nAnd this will produce a flow chart:\n\n```mermaid\ngraph LR\nA[Square Rect] -- Link text --> B((Circle))\nA --> C(Round Rect)\nB --> D{Rhombus}\nC --> D\n```\n","properties":"\n","discussions":{},"comments":{},"hash":-1743464469},"Kcaww5xBmJmy9HDV/content":{"id":"Kcaww5xBmJmy9HDV/content","type":"content","text":"# Customizing the default BayesPI-BAR2 pipeline\nThe `bayespi_bar2_pipeline.py` script is the starting point for users wishing to use **BayesPI-BAR2** to process their own datasets. It shows a reasonable sequence of execution of the main package tools to obtain a final result. The source code in the file is simple, well-commented and should be easy to modify. The pipeline, as it is implemented in this script, can be logically divided into 8 steps, each step being a call to a tool from the package:\n\n1.  Compute differentially expressed genes between patient group and the normal cell group (here we use gene expression in melanocytes as the normal group). Calls `differential_expression.py`.\n2.  Select _regions of interest_, here defined as regions near transcription start sites of differentially expressed genes. Calls `gene_regions.py`.\n3.  Compute mutation blocks in the regions of interest using **MuSSD**. Calls `mussd.py`.\n4.  Select those blocks that are mutated more than average. The melanoma dataset contains large number of mutations, leading to many identified mutation blocks. This step removes 90% of blocks that have relatively few mutations. In cases when there are few mutation blocks identified by **MuSSD**, this step is probably unnecessary. Calls `highly_mutated_blocks.py`.\n5.  Compute affinity changes for the foreground (patient) mutation blocks using **BayesPI-BAR**. Calls `bayespi_bar.py`.\n6.  Compute the random background model for affinity changes, matching its parameters to the chosen foreground blocks. Calls `background_affinity_changes.py`.\n7.  Run the affinity change significance tests for all foreground blocks vs. the background model. Calls `affinity_change_significance_test.py`.\n8.  Remove the transcription factors that are not expressed in patient samples from the final predictions. This is implemented as an auxiliary tool from the demo folder because it relies on the specific naming convention of the supplied PWM database.\n","properties":"\n","discussions":{},"comments":{},"hash":-1592428837},"F0kmy4RsN8i2DHCd/content":{"id":"F0kmy4RsN8i2DHCd/content","type":"content","text":"\n# BayesPI-BAR2: a new Python package for predicting functional non-coding mutations in cancer patient cohorts\n<img src=\"dnk.jpg\" alt=\"This work was supported by the Norwegian Cancer Society\" title=\"This work was supported by the Norwegian Cancer Society\" width=\"150\" align=\"middle\"/>  <img src=\"OUS_logo_eng.jpg\" align=\"middle\" alt=\"Oslo University Hospital\" title=\"Oslo University Hospital\" hspace=\"20\" width=\"150\" />  <img src=\"helse-sor-ost.jpg\" alt=\"This work was supported by the South-Eastern Norway Regional Health Authority\" title=\"This work was supported by the South-Eastern Norway Regional Health Authority\" align=\"middle\" width=\"150\"/>\n\n## Authors \n[Kirill Batmanov](mailto:batmanov.kn@gmail.com)^1^, Jan Delabie^2^, and [Junbai Wang](mailto:junbai.wang@rr-research.no)^1^\n\n^1^Department of Pathology, Norwegian Radium Hospital, PO Box 4953 Nydalen, 0424 Oslo, Norway\n\n^2^Department of Pathology, University Health Network, Toronto, Ontario, Canada\n\n\n## Introduction \n**BayesPI-BAR2** [4] is a package designed to predict how non-coding somatic mutations in cancer samples affect protein-DNA binding at the mutated place. Changes in binding of transcription factors to mutated regulatory sequences can lead to disrupted gene regulation, which may promote tumorigenesis. **BayesPI-BAR2** takes into account the possibility for several nearby mutations to affect binding of the same protein. The predicted effects are tested for significance in the given patient cohort, and only those that appear in patient samples more frequently than expected by chance are reported.\n\n\n## Getting started \n\n**BayesPI-BAR2** is written in Python 2. It includes our **BayesPI2** [1][2] software in binary form, which is available for Linux and OS X operating systems. Here is the full list of dependencies:\n\n-   Python 2 interpreter: [https://www.python.org/downloads/](https://www.python.org/downloads/)\n-   SciPy library: [https://www.scipy.org/](https://www.scipy.org/)\n-   matplotlib, if the plot making function is used: [https://matplotlib.org/](https://matplotlib.org/)\n-   bedtools: [http://bedtools.readthedocs.io/en/latest/](http://bedtools.readthedocs.io/en/latest/)\n\nYou can use the `pip install scipy matplotlib` command to install the Python libraries.\n\n==The **BayesPI-BAR2** package can be downloaded [here](bayespi_bar2_package.tgz).==\n\nTo test the basic functionality, go to the `demo/melanoma_small` folder and run the command `python melanoma_small_pipeline.py` . After downloading the reference human genome, the test pipeline should complete without errors in a few minutes and produce the result file, `data/skin_cancer_small/out/foreground/block_0_5_1295228_1295253/result.tsv` with several ETS factors mentioned in it.\n\n## Package contents\n\nThe package has four subfolders:\n\n-   `bin`: the binaries of **BayesPI2**\n-   `demo`: the two example pipelines, `melanoma_small` for a quick test and `melanoma_full` for a complete application\n-   `data`: the folder from which the demos take their input data and where they put their outputs\n-   `python`: the folder with the package Python source code\n\nThe main package is a set of command line tools residing in the `python` folder. Run `python <tool_name.py> --help` command to see the full usage information for a particular tool. The purpose of each tool and the data involved in the processing are described below:\n\n-   `differential_expression.py`: computes differentially expressed genes between two groups of samples, usually the patient samples and normal tissue samples. This implements a relatively simple and fast method based on Kolmogorov-Smirnov test comparing two sets of normalized RPKM values. For a more precise analysis, the [baySeq](http://bioconductor.org/packages/release/bioc/html/baySeq.html) R package could be used instead.  \n    _Input:_ two sets of read count files from RNA-Seq experiments in the tab-delimited format  \n    _Output:_ list of differentially expressed genes\n-   `gene_regions.py`: extracts gene regions based on offsets from transcription start sites.  \n    _Input:_ gene annotation GTF file  \n    _Output:_ BED file with selected regions\n-   `intersect_vcf.py`: computes intersection between VCF files.  \n    _Input:_ a set of VCF files  \n    _Output:_ VCF file\n-   `mussd.py`: implements the Mutation filtering based on the Space and Sample Distribution (**MuSSD**) algorithm which finds DNA regions that are highly mutated in multiple patients (_mutation blocks_).  \n    _Input:_ a set of VCF files with patient somatic mutations, one per patient, a BED file with regions of interest, optionally a set of VCF files with patient germline mutations\n    _Output:_ a pair of FASTA files for each block, containing reference and alternate sequences for each patient, in the format expected by `bayespi_bar.py`\n-   `highly_mutated_blocks.py`: a simple method to find which blocks appear to have higher than average mutation rate, used to discard blocks with few mutations.  \n    _Input:_ output of `mussd.py`  \n    _Output:_ list of highly mutated blocks\n-   `bayespi_bar.py`: implements the **BayesPI-BAR** [3] method to compute the protein-DNA binding affinity changes due to sequence variants.  \n    _Input:_ two FASTA files with a set of paired reference and alternate sequences, as well as a folder containing PWM models in BayesPI format. The set of 1772 PWMs used in the pipeline is provided in the `data/pwm` folder  \n    _Output:_ rankings of PWMs by predicted effect size, δdbA values for all PWMs and variants\n-   `choose_background_parameters.py`: selects appropriate parameters (sequence size and mutation count distribution) for the background model based on chosen foreground (i.e. patient) mutation blocks.  \n    _Input:_ output of `mussd.py` and `bayespi_bar.py`, optionally a mutation signature file  \n    _Output:_ Bash script which runs `background_affinity_changes.py` with chosen parameters\n-   `background_affinity_changes.py`: selects random mutation blocks for the background model and computes the background model using `bayespi_bar.py`.  \n    _Input:_ BED file with regions of interest, a folder with PWM files, optionally a mutation signature file  \n    _Output:_ δdbA values for all PWMs and randomly generated variants (same as `bayespi_bar.py`)\n-   `affinity_change_significance_test.py`: performs the Wilcoxon rank-sum testing, comparing the patient affinity changes in mutation blocks to the background model.  \n    _Input:_ a pair of outputs of `bayespi_bar.py`, for the background model and a mutation block  \n    _Output:_ a table of PWMs which are affected in the foreground block significantly more than expected according to the background model\n-   `plot_result.py`: produces heatmaps displaying predicted affinity changes across transcription factors and patient samples.  \n    _Input:_ output of `affinity_change_significance_test.py` and `bayespi_bar.py`  \n    _Output:_ PNG file\n\n## Skin cancer demonstration pipeline \n\n\nThe package includes an example analysis pipeline which reproduces the known result about mutations in the _TERT_ gene promoter that create binding sites for ETS family transcription factors. The pipeline calls the main package tools in appropriate sequence, reporting the progress of the computation.\n\nTo run the pipeline, go to the `demo/melanoma_full` folder and run the following commands:\n\n1.  `python get_and_preprocess_data.py` to download the input and reference data and preprocess it into the right format.\n2.  `python bayespi_bar2_pipeline.py` to execute the main pipeline code. This will take about one full day of computation on a multi-core machine. The computation speed can be greatly improved if you run the pipeline on a cluster which supports the SLURM queue manager. Edit the `parallel_options.txt` file in the same folder to specify the desired parallelization configuration. Check the help of `bayespi_bar.py` from the main package to learn about the parallelization options.\n3.  `python make_plots.py` to make the heatmaps for the significantly affected transcription factors in the foreground blocks.\n\nThe main pipeline script, `bayespi_bar2_pipeline.py`, is designed to be robust to interruptions. If the pipeline execution was interrupted at any point, simply run the script again, and it will resume calculation from the place it was interrupted. You can see the progress of the computation as well as the main pipeline parameters in the log file, whose location is printed on the screen when the pipeline starts.\n\n`bayespi_bar2_pipeline.py` is supposed to be the starting point for users wishing to use **BayesPI-BAR2** to process their own datasets. It shows a reasonable sequence of execution of the main package tools to obtain a final result. The source code in the file is simple, well-commented and should be easy to modify. The pipeline, as it is implemented in this script, can be logically divided into 8 steps, each step being a call to a tool from the package:\n\n1.  Compute differentially expressed genes between patient group and the normal cell group (here we use gene expression in melanocytes as the normal group). Calls `differential_expression.py`.\n2.  Select _regions of interest_, here defined as regions near transcription start sites of differentially expressed genes. Calls `gene_regions.py`.\n3.  Compute mutation blocks in the regions of interest using **MuSSD**. Calls `mussd.py`.\n4.  Select those blocks that are mutated more than average. The melanoma dataset contains large number of mutations, leading to many identified mutation blocks. This step removes 90% of blocks that have relatively few mutations. In cases when there are few mutation blocks identified by **MuSSD**, this step is probably unnecessary. Calls `highly_mutated_blocks.py`.\n5.  Compute affinity changes for the foreground (patient) mutation blocks using **BayesPI-BAR**. Calls `bayespi_bar.py`.\n6.  Compute the random background model for affinity changes, matching its parameters to the chosen foreground blocks. Calls `background_affinity_changes.py`.\n7.  Run the affinity change significance tests for all foreground blocks vs. the background model. Calls `affinity_change_significance_test.py`.\n8.  Remove the transcription factors that are not expressed in patient samples from the final predictions. This is implemented as an auxiliary tool from the demo folder because it relies on the specific naming convention of the supplied PWM database.\n\nThe `get_and_preprocess_data.py` script will download about 2 Gb of data necessary for the pipeline. Here is the full list of additional files that will be downloaded:\n\n-   The reference genome hs37d5: [ftp://ftp.1000genomes.ebi.ac.uk/vol1/ftp/technical/reference/phase2_reference_assembly_sequence/hs37d5.fa.gz](ftp://ftp.1000genomes.ebi.ac.uk/vol1/ftp/technical/reference/phase2_reference_assembly_sequence/hs37d5.fa.gz)\n-   The GENCODE gene annotation v.19: [ftp://ftp.ebi.ac.uk/pub/databases/gencode/Gencode_human/release_19/gencode.v19.annotation.gtf.gz](ftp://ftp.ebi.ac.uk/pub/databases/gencode/Gencode_human/release_19/gencode.v19.annotation.gtf.gz)\n-   The skin cancer input data and the normal melanocyte expression (once the paper is accepted for publication then the data set will be available for download): [hosted on this server](skin_cancer_icgc_and_normal_melanocytes_geo_data.tgz)\n\n## References\n1. BayesPI - a new model to study protein-DNA interactions: a case study of condition-specific protein binding parameters for Yeast transcription factors. Wang J, Morigen. _BMC Bioinformatics_. 2009 Oct 20;10:345. doi: 10.1186/1471-2105-10-345. [[PMID:19857274]](https://www.ncbi.nlm.nih.gov/pubmed/19857274) \n2. Quality versus accuracy: result of a reanalysis of protein-binding microarrays from the DREAM5 challenge by using BayesPI2 including dinucleotide interdependence. Wang J. _BMC Bioinformatics_. 2014 Aug 27;15:289. doi: 10.1186/1471-2105-15-289. [[PMID:25158938]](https://www.ncbi.nlm.nih.gov/pubmed/25158938)\n3. BayesPI-BAR: a new biophysical model for characterization of regulatory sequence variations. Wang J, Batmanov K. _Nucleic Acids Res._ 2015 Dec 2;43(21):e147. doi: 10.1093/nar/gkv733 [[PMID:26202972]](https://www.ncbi.nlm.nih.gov/pubmed/26202972)\n4. Integrative whole-genome sequence analysis reveals roles of regulatory mutations in BCL6 and BCL2 in follicular lymphoma. Batmanov K, Wang W, Bjoras M, Delabie J, Wang J. _Sci Rep._ 2017 Aug 1;7(1):7040. doi: 10.1038/s41598-017-07226-4. [[PMID:28765546]](https://www.ncbi.nlm.nih.gov/pubmed/28765546)\n5. BayesPI-BAR2: a Python package for predicting functional non-coding mutations in cancer patient cohorts. Kirill Batmanov, Jan Delabie, and Junbai Wang (_submitted_)\n\n  \n","properties":"\n","discussions":{},"comments":{},"hash":1041197786},"skvgCmmZNAXxQzk4/content":{"id":"skvgCmmZNAXxQzk4/content","type":"content","text":"\n\n# BayesPI-BAR2: a new Python package for predicting functional non-coding mutations in cancer patient cohorts\n<img src=\"dnk.jpg\" alt=\"This work was supported by the Norwegian Cancer Society\" title=\"This work was supported by the Norwegian Cancer Society\" width=\"150\" align=\"middle\"/>  <img src=\"OUS_logo_eng.jpg\" align=\"middle\" alt=\"Oslo University Hospital\" title=\"Oslo University Hospital\" hspace=\"20\" width=\"150\" />  <img src=\"helse-sor-ost.jpg\" alt=\"This work was supported by the South-Eastern Norway Regional Health Authority\" title=\"This work was supported by the South-Eastern Norway Regional Health Authority\" align=\"middle\" width=\"150\"/>\n\n## Authors \n[Kirill Batmanov](mailto:batmanov.kn@gmail.com)^1^, Jan Delabie^2^, and [Junbai Wang](mailto:junbai.wang@rr-research.no)^1^\n\n^1^Department of Pathology, Norwegian Radium Hospital, PO Box 4953 Nydalen, 0424 Oslo, Norway\n\n^2^Department of Pathology, University Health Network, Toronto, Ontario, Canada\n\n\n## Introduction \n**BayesPI-BAR2** [4] is a package designed to predict how non-coding somatic mutations in cancer samples affect protein-DNA binding at the mutated place. Changes in binding of transcription factors to mutated regulatory sequences can lead to disrupted gene regulation, which may promote tumorigenesis. **BayesPI-BAR2** takes into account the possibility for several nearby mutations to affect binding of the same protein. The predicted effects are tested for significance in the given patient cohort, and only those that appear in patient samples more frequently than expected by chance are reported.\n\n\n## Getting started \n\n**BayesPI-BAR2** is written in Python 2. It includes our **BayesPI2** [1][2] software in binary form, which is available for Linux and OS X operating systems. Here is the full list of dependencies:\n\n-   Python 2 interpreter: [https://www.python.org/downloads/](https://www.python.org/downloads/)\n-   SciPy library: [https://www.scipy.org/](https://www.scipy.org/)\n-   matplotlib, if the plot making function is used: [https://matplotlib.org/](https://matplotlib.org/)\n-   bedtools: [http://bedtools.readthedocs.io/en/latest/](http://bedtools.readthedocs.io/en/latest/)\n\nYou can use the `pip install scipy matplotlib` command to install the Python libraries.\n\n==The **BayesPI-BAR2** package can be downloaded [here](bayespi_bar2_package.tgz).==\n\nTo test the basic functionality, go to the `demo/melanoma_small` folder and run the command `python melanoma_small_pipeline.py` . After downloading the reference human genome, the test pipeline should complete without errors in a few minutes and produce the result file, `data/skin_cancer_small/out/foreground/block_0_5_1295228_1295253/result.tsv` with several ETS factors mentioned in it.\n\n## Package contents\n\nThe package has four subfolders:\n\n-   `bin`: the binaries of **BayesPI2**\n-   `demo`: the two example pipelines, `melanoma_small` for a quick test and `melanoma_full` for a complete application\n-   `data`: the folder from which the demos take their input data and where they put their outputs\n-   `python`: the folder with the package Python source code\n\nThe main package is a set of command line tools residing in the `python` folder. Run `python <tool_name.py> --help` command to see the full usage information for a particular tool. The detailed description of every tool is [here](pipeline_tools.html).\n\n\n## Skin cancer demonstration pipeline \n\n\nThe package includes an example analysis pipeline which reproduces the known result about mutations in the _TERT_ gene promoter that create binding sites for ETS family transcription factors. The pipeline calls the main package tools in appropriate sequence, reporting the progress of the computation.\n\nTo run the pipeline, go to the `demo/melanoma_full` folder and run the following commands:\n\n1.  `python get_and_preprocess_data.py` to download the input and reference data and preprocess it into the right format.\n2.  `python bayespi_bar2_pipeline.py` to execute the main pipeline code. This will take about one full day of computation on a multi-core machine. The computation speed can be greatly improved if you run the pipeline on a cluster which supports the SLURM queue manager. Edit the `parallel_options.txt` file in the same folder to specify the desired parallelization configuration. Check the help of `bayespi_bar.py` from the main package to learn about the parallelization options.\n3.  `python make_plots.py` to make the heatmaps for the significantly affected transcription factors in the foreground blocks.\n\nThe main pipeline script, `bayespi_bar2_pipeline.py`, is designed to be robust to interruptions. If the pipeline execution was interrupted at any point, simply run the script again, and it will resume calculation from the place it was interrupted. You can see the progress of the computation as well as the main pipeline parameters in the log file, whose location is printed on the screen when the pipeline starts.\n\nThe `get_and_preprocess_data.py` script will download about 2 Gb of data necessary for the pipeline. Here is the full list of additional files that will be downloaded:\n\n-   The reference genome hs37d5: [ftp://ftp.1000genomes.ebi.ac.uk/vol1/ftp/technical/reference/phase2_reference_assembly_sequence/hs37d5.fa.gz](ftp://ftp.1000genomes.ebi.ac.uk/vol1/ftp/technical/reference/phase2_reference_assembly_sequence/hs37d5.fa.gz)\n-   The GENCODE gene annotation v.19: [ftp://ftp.ebi.ac.uk/pub/databases/gencode/Gencode_human/release_19/gencode.v19.annotation.gtf.gz](ftp://ftp.ebi.ac.uk/pub/databases/gencode/Gencode_human/release_19/gencode.v19.annotation.gtf.gz)\n-   The skin cancer input data and the normal melanocyte expression (once the paper is accepted for publication then the data set will be available for download): [hosted on this server](skin_cancer_icgc_and_normal_melanocytes_geo_data.tgz)\n\n## Customizing the pipeline\n\nThe `bayespi_bar2_pipeline.py` script is the starting point for users wishing to use **BayesPI-BAR2** to process their own datasets. The instructions for customizing the default pipeline can be found [here](customizing_pipeline.html).\n\n## References\n1. BayesPI - a new model to study protein-DNA interactions: a case study of condition-specific protein binding parameters for Yeast transcription factors. Wang J, Morigen. _BMC Bioinformatics_. 2009 Oct 20;10:345. doi: 10.1186/1471-2105-10-345. [[PMID:19857274]](https://www.ncbi.nlm.nih.gov/pubmed/19857274) \n2. Quality versus accuracy: result of a reanalysis of protein-binding microarrays from the DREAM5 challenge by using BayesPI2 including dinucleotide interdependence. Wang J. _BMC Bioinformatics_. 2014 Aug 27;15:289. doi: 10.1186/1471-2105-15-289. [[PMID:25158938]](https://www.ncbi.nlm.nih.gov/pubmed/25158938)\n3. BayesPI-BAR: a new biophysical model for characterization of regulatory sequence variations. Wang J, Batmanov K. _Nucleic Acids Res._ 2015 Dec 2;43(21):e147. doi: 10.1093/nar/gkv733 [[PMID:26202972]](https://www.ncbi.nlm.nih.gov/pubmed/26202972)\n4. Integrative whole-genome sequence analysis reveals roles of regulatory mutations in BCL6 and BCL2 in follicular lymphoma. Batmanov K, Wang W, Bjoras M, Delabie J, Wang J. _Sci Rep._ 2017 Aug 1;7(1):7040. doi: 10.1038/s41598-017-07226-4. [[PMID:28765546]](https://www.ncbi.nlm.nih.gov/pubmed/28765546)\n5. BayesPI-BAR2: a Python package for predicting functional non-coding mutations in cancer patient cohorts. Kirill Batmanov, Jan Delabie, and Junbai Wang (_submitted_)\n\n","properties":"\n","discussions":{},"comments":{},"hash":1026926726},"ymxpGNslZiJsGDeS/content":{"id":"ymxpGNslZiJsGDeS/content","type":"content","text":"# BayesPI-BAR2 pipeline tools\n\nThe **BayesPI-BAR2** package is a set of command line tools residing in the `python` folder. Run `python <tool_name.py> --help` command to see the full usage information for a particular tool. The purpose of each tool and the data involved in the processing are described below:\n\n-   `differential_expression.py`: computes differentially expressed genes between two groups of samples, usually the patient samples and normal tissue samples. This implements a relatively simple and fast method based on Kolmogorov-Smirnov test comparing two sets of normalized RPKM values. For a more precise analysis, the [baySeq](http://bioconductor.org/packages/release/bioc/html/baySeq.html) R package could be used instead.  \n    _Input:_ two sets of read count files from RNA-Seq experiments in the tab-delimited format  \n    _Output:_ list of differentially expressed genes\n-   `gene_regions.py`: extracts gene regions based on offsets from transcription start sites.  \n    _Input:_ gene annotation GTF file  \n    _Output:_ BED file with selected regions\n-   `intersect_vcf.py`: computes intersection between VCF files.  \n    _Input:_ a set of VCF files  \n    _Output:_ VCF file\n-   `mussd.py`: implements the Mutation filtering based on the Space and Sample Distribution (**MuSSD**) algorithm which finds DNA regions that are highly mutated in multiple patients (_mutation blocks_).  \n    _Input:_ a set of VCF files with patient somatic mutations, one per patient, a BED file with regions of interest, optionally a set of VCF files with patient germline mutations\n    _Output:_ a pair of FASTA files for each block, containing reference and alternate sequences for each patient, in the format expected by `bayespi_bar.py`\n-   `highly_mutated_blocks.py`: a simple method to find which blocks appear to have higher than average mutation rate, used to discard blocks with few mutations.  \n    _Input:_ output of `mussd.py`  \n    _Output:_ list of highly mutated blocks\n-   `bayespi_bar.py`: implements the **BayesPI-BAR** [3] method to compute the protein-DNA binding affinity changes due to sequence variants.  \n    _Input:_ two FASTA files with a set of paired reference and alternate sequences, as well as a folder containing PWM models in BayesPI format. The set of 1772 PWMs used in the pipeline is provided in the `data/pwm` folder  \n    _Output:_ rankings of PWMs by predicted effect size, δdbA values for all PWMs and variants\n-   `choose_background_parameters.py`: selects appropriate parameters (sequence size and mutation count distribution) for the background model based on chosen foreground (i.e. patient) mutation blocks.  \n    _Input:_ output of `mussd.py` and `bayespi_bar.py`, optionally a mutation signature file  \n    _Output:_ Bash script which runs `background_affinity_changes.py` with chosen parameters\n-   `background_affinity_changes.py`: selects random mutation blocks for the background model and computes the background model using `bayespi_bar.py`.  \n    _Input:_ BED file with regions of interest, a folder with PWM files, optionally a mutation signature file  \n    _Output:_ δdbA values for all PWMs and randomly generated variants (same as `bayespi_bar.py`)\n-   `affinity_change_significance_test.py`: performs the Wilcoxon rank-sum testing, comparing the patient affinity changes in mutation blocks to the background model.  \n    _Input:_ a pair of outputs of `bayespi_bar.py`, for the background model and a mutation block  \n    _Output:_ a table of PWMs which are affected in the foreground block significantly more than expected according to the background model\n-   `plot_result.py`: produces heatmaps displaying predicted affinity changes across transcription factors and patient samples.  \n    _Input:_ output of `affinity_change_significance_test.py` and `bayespi_bar.py`  \n    _Output:_ PNG file\n","properties":"\n","discussions":{},"comments":{},"hash":1203570781},"o1fkEBNvhS0HUnIY":{"id":"o1fkEBNvhS0HUnIY","type":"file","name":"Welcome file","parentId":null,"hash":-585715289},"F0kmy4RsN8i2DHCd":{"id":"F0kmy4RsN8i2DHCd","type":"file","name":"single_page","parentId":null,"hash":1929176131},"skvgCmmZNAXxQzk4":{"id":"skvgCmmZNAXxQzk4","type":"file","name":"main","parentId":null,"hash":-309983290},"ymxpGNslZiJsGDeS":{"id":"ymxpGNslZiJsGDeS","type":"file","name":"pipeline_tools","parentId":null,"hash":-2129490421},"Kcaww5xBmJmy9HDV":{"id":"Kcaww5xBmJmy9HDV","type":"file","name":"customizing_pipeline","parentId":null,"hash":1124266446},"templates":{"id":"templates","type":"data","data":{},"hash":-972705388},"localSettings":{"id":"localSettings","type":"data","data":{"welcomeFileHashes":{"1356433143":1},"filePropertiesTab":"simple","htmlExportTemplate":"styledHtml","pdfExportTemplate":"styledHtml","pandocExportFormat":"pdf","googleDriveRestrictedAccess":false,"googleDriveFolderId":"","googleDriveWorkspaceFolderId":"","googleDrivePublishFormat":"markdown","googleDrivePublishTemplate":"styledHtml","bloggerBlogUrl":"","bloggerPublishTemplate":"plainHtml","dropboxRestrictedAccess":false,"dropboxPublishTemplate":"styledHtml","githubRepoFullAccess":false,"githubRepoUrl":"","githubWorkspaceRepoUrl":"","githubPublishTemplate":"jekyllSite","gistIsPublic":false,"gistPublishTemplate":"plainText","gitlabServerUrl":"","gitlabApplicationId":"","gitlabProjectUrl":"","gitlabWorkspaceProjectUrl":"","gitlabPublishTemplate":"plainText","wordpressDomain":"","wordpressPublishTemplate":"plainHtml","zendeskSiteUrl":"","zendeskClientId":"","zendescPublishSectionId":"","zendescPublishLocale":"","zendeskPublishTemplate":"plainHtml"},"hash":1947627782},"lastOpened":{"id":"lastOpened","type":"data","data":{"o1fkEBNvhS0HUnIY":1541703534010,"F0kmy4RsN8i2DHCd":1546460523104,"skvgCmmZNAXxQzk4":1546460578468,"ymxpGNslZiJsGDeS":1546460538238,"Kcaww5xBmJmy9HDV":1546460558417},"hash":2036223428}}